# IsCloudConfiguration Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationConfigurationInfo..::..IsCloudConfiguration Property
FabricationConfigurationInfo Class See Also
---
Whether the cloud configuration is a remote cloud one.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public bool IsCloudConfiguration { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsCloudConfiguration As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsCloudConfiguration {
	bool get ();
}
```

# See Also
FabricationConfigurationInfo Class
Autodesk.Revit.DB Namespace